# [::-1] обратном навправлении
# print(n2[:len(n2) // 2]) - до середины, print(n2[len(n2) // 2:]) - после середины
# bin() преобразует целое число в его двоичное представление в виде строки
'''
r5 = n5[-1] + n5[:-1]
Разбор по частям:
Пусть n5 = "23" (как в примере с N=13)

n5[-1] - берёт последний символ строки

Индекс -1 означает последний элемент

"23"[-1] = "3"

n5[:-1] - берёт все символы кроме последнего

"23"[:-1] = "2" (от начала до предпоследнего)

n5[-1] + n5[:-1] - конкатенация (склеивание)

"3" + "2" = "32"
'''
'''
for n in range(1 ,1000):
    n2 = bin(n)[2:] # первые 2 числа 0 и b поэтому начинаем с третьего
    if n % 2 == 0:
        n2 = n2.replace('1', '11')
    else:
        n2 = n2.replace('0', '00')
    r = int(n2, 2)
    if r > 70:
        print(n)
        break
'''
'''
a = [] # создаем список если нужно узнать макс
for n in range(1, 1000):
    n2 = bin(n)[2:]
    if n % 3 == 0:
        n2 += n2[-3:] # дописываются три последние двоичные цифры
    else:
        n2 += bin((n % 3 + 1) * 3)[2:]
        r = int(n2, 2) # перевод числа в двоич.сист.счисл
        if r <= 416:
            a.append(r) # добавляем в список
print(max(a))
'''
'''
for n in range(1 ,1000):
    n2 = bin(n)[2:]
    if n % 2 == 0:
        n2 += '0'
    else:
        n2 += '1'
    if n2.count('1') % 3 == 0: # если просят если на втором шаге алгоритма
        n2 = '11' + n2[2:] # два левый разряда заменяются на 11
    else:
        n2 = '10' + n2[2:]
    r = int(n2, 2)
    if r >= 26:
        print(n)
        break
'''
'''
# приер в 4 тверичную
def to_4(n):
    n4 = ''
    while n > 0:
        n4 += str(n % 4)
        n //= 4
    return n4[::-1] # переворачивем

for n in range(1, 1000):
    n4 = to_4(n)
'''
'''
n = 116  # исходное число
n2 = bin(n)[2:]  # 1110100

if len(n2) % 2 == 1:
    d = len(n2) // 2
    new_n2 = n2[:d] + n2[d+1:]  # удаляем одну центральную
else:
    d = len(n2) // 2
    new_n2 = n2[:d-1] + n2[d+1:]  # удаляем две центральные

r = int(new_n2, 2)
print(r)
'''   
'''
for n in range(1, 1000):
    n2 = bin(n)[2:]
    if n % 3 == 0:
        n2 += n2[-3:]
    else:
        n2 += bin((n % 3)*3)[2:]
    r = int(n2, 2)
    if r >= 200:
        print(n)
        break
'''
'''

def to_5(n):
    n5 = ''
    while n > 0:
        n5 += str(n % 5)
        n //= 5
        return n5[::-1]

for n in range(1, 1000):
    n5 = to_5(n)
    summa = sum(int(d) for d in 5)
    if summa % 2 != 0:
        posl = n5[-1] + n5[:-1]
    else:
        n5 += bin((n[-1])*3)[2:]
        r = int(n5, 2)
        zero = n5.count('0')
        if r > zero == 2
'''




